# Design 1 -- mult_detector -> sky130 HD standard cells
read_verilog -sv rtl/mult_detector.v
hierarchy -top mult_detector
synth -top mult_detector -flatten
dfflibmap -liberty synth/sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty synth/sky130_fd_sc_hd__tt_025C_1v80.lib
opt_clean
delete t:$scopeinfo
stat -liberty synth/sky130_fd_sc_hd__tt_025C_1v80.lib
write_verilog -noattr synth/mult_detector_netlist.v
